 // Модуль 6.2 

  // Задание 1

 /* const arr = [ 1, 4, null, 2, "rrg", "efe", 0, 3, 4, 5, 6, 0, 7, 10, true, NaN,];
 


  function getNumEvenAndOdd() {
  let evenNum = 0;
 let oddNum = 0;
 let zero = 0;
 
 arr.forEach(function(item, index,){
 if( typeof item === "number" && !(isNaN(item)))
   if ( item % 2 == 0 && item != 0 ) {
   evenNum++
   } else if (item % 2 != 0 && item != 0 ){
   oddNum++
   } else if (item == 0 ) {
   zero++
   }
   
 })
 
 console.log(evenNum)
 console.log(oddNum)
 console.log(zero)
  }
  
  getNumEvenAndOdd() */

//   В прошлом модуле в разделе «Циклы» вы выполняли следующее задание:
//   Дан массив. Нужно вывести в консоль количество чётных и нечётных элементов в массиве. Если в массиве есть нулевой элемент, то он учитывается и выводится отдельно. 
//   При выполнении задания необходимо учесть, что массив может содержать не только числа, но и, например, знаки, null и так далее.
//   На этот раз оформите решение в виде функции, постарайтесь дать этой функции корректное название, вызовите функцию, проанализируйте синтаксис.
//   Удачи! 