 // Задание 2

  /* const simpleNum = (num) => {
  if (num > 1000){
  return alert(" Данные неверны ")
  } else if (num <= 1){
  return alert("Число составное")
  }
  
  for ( let i = 2; i <= num; i++){
    if( num % i == 0){
    return alert("Число составное")
    } else {
    return alert("Число простое")
    }
  }
}

simpleNum(1) */

// Написать функцию, которая принимает на входе любое число (но не больше 1 000), 
// определяет, является ли оно простым, и выводит простое число или нет. 
// Если введено больше 1 000, то выводится сообщение, что данные неверны. Обратите внимание на числа 0 и 1.

